package com.kh.chap02.loop;

public class A_For {
	
	/*
	 * for문
	 * 반복하고자 하는 횟수가 정해져 있을 경우 사용
	 * 괄호 안에 반복을 지정하는 부분이 초기식, 조건식, 증감식으로 이루어져 있음
	 * 각 초기식, 조건식, 증감식에 의해서 반복할 횟수가 정해짐
	 * 
	 * [ 표현법 ]
	 * for(초기식; 조건식; 증감식) {
	 * 		반복적으로 실행하고자 하는 코드;
	 * }
	 * 
	 * - 초기식:반복문이 시작될 때 "초기에 단 한 번만 실행"되는 구문
	 * 		  (반복문에서 횟수를 지정할 때 쓰고자 하는 변수를 선언 및 초기화하는 구문)
	 * 			ex) int i = 1;
	 * - 조건식: "반복문이 수행될 조건"을 작성하는 구문
	 * 			조건식이 true일 경우 반복문 실행
	 * 			조건식이 false가 되는 순간 반복문이 멈춤
	 * 			(보통 초기식에 제시된 변수를 가지고 조건식을 작성)
	 * 			ex) i < 10;
	 * - 증감식: 반복문을 제어하는 변수값을 증감시키는 구문
	 * 			(보통 초기식에 제시된 변수를 가지고 증감식을 작성)
	 * 			ex) i++; 
	 * 
	 */
	
	

}
